OpenFOAMObject/meshParticle/haukur_case_class_solver/ergoCart/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //front
    wallProlongation
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    //back
    wallDiffuser
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    //wall
    statSwirlWall
    {
        type            slip; //fixedValue;
        value           uniform (0 0 0);
    }
    //porosityWall
    rotSwirlWall
    {
        type            fixedValue; //slip;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            flowRateInletVelocity;
        flowRate        0.1;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            inletOutlet;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
}

// ************************************************************************* //
