OpenFOAMObject/meshParticle/haukur_case_class_solver/ergoCart/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{

    //front
    wallProlongation
    {
        type            zeroGradient;
    }
    //back
    wallDiffuser
    {
        type            zeroGradient;
    }
    //wall
    statSwirlWall
    {
        type            zeroGradient;
    }
    //porosityWall
    rotSwirlWall
    {
        type            zeroGradient;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

}
// ************************************************************************* //
