OpenFOAMObject/meshParticle/haukur_case_class_solver/ergoCart/constant/polyMesh/blockMeshDict
// Parametrized test case for the ERCOFTAC diffusor.

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:





//Mathematical constants:


//Geometry






//Grid points (integers!):









//Plane A:





//Plane B:





//Plane C:





//Plane D:





//Plane E:





//Plane F:





/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//Plane A:
(0.0643467170878116 -0.06434671708814 -0.50) // Vertex A0 = 0 
(0.0643467170878116 0.06434671708814 -0.50) // Vertex A1 = 1 
(-0.0643467170878116 0.06434671708814 -0.50) // Vertex A2 = 2 
(-0.0643467170878116 -0.06434671708814 -0.50) // Vertex A3 = 3 
(0.0919238815540166 -0.0919238815544857 -0.50) // Vertex A4 = 4 
(0.0919238815540166 0.0919238815544857 -0.50) // Vertex A5 = 5 
(-0.0919238815540166 0.0919238815544857 -0.50) // Vertex A6 = 6 
(-0.0919238815540166 -0.0919238815544857 -0.50) // Vertex A7 = 7 

//Plane B:
(0.0643467170878116 -0.06434671708814 -0.10) // Vertex B0 = 8 
(0.0643467170878116 0.06434671708814 -0.10) // Vertex B1 = 9 
(-0.0643467170878116 0.06434671708814 -0.10) // Vertex B2 = 10 
(-0.0643467170878116 -0.06434671708814 -0.10) // Vertex B3 = 11 
(0.0919238815540166 -0.0919238815544857 -0.10) // Vertex B4 = 12 
(0.0919238815540166 0.0919238815544857 -0.10) // Vertex B5 = 13 
(-0.0919238815540166 0.0919238815544857 -0.10) // Vertex B6 = 14 
(-0.0919238815540166 -0.0919238815544857 -0.10) // Vertex B7 = 15 

//Plane C:
(0.0643467170878116 -0.06434671708814 -0.025) // Vertex C0 = 16 
(0.0643467170878116 0.06434671708814 -0.025) // Vertex C1 = 17 
(-0.0643467170878116 0.06434671708814 -0.025) // Vertex C2 = 18 
(-0.0643467170878116 -0.06434671708814 -0.025) // Vertex C3 = 19 
(0.0919238815540166 -0.0919238815544857 -0.025) // Vertex C4 = 20 
(0.0919238815540166 0.0919238815544857 -0.025) // Vertex C5 = 21 
(-0.0919238815540166 0.0919238815544857 -0.025) // Vertex C6 = 22 
(-0.0919238815540166 -0.0919238815544857 -0.025) // Vertex C7 = 23 

//Plane D:
(0.0643467170878116 -0.06434671708814 0) // Vertex D0 = 24 
(0.0643467170878116 0.06434671708814 0) // Vertex D1 = 25 
(-0.0643467170878116 0.06434671708814 0) // Vertex D2 = 26 
(-0.0643467170878116 -0.06434671708814 0) // Vertex D3 = 27 
(0.0919238815540166 -0.0919238815544857 0) // Vertex D4 = 28 
(0.0919238815540166 0.0919238815544857 0) // Vertex D5 = 29 
(-0.0919238815540166 0.0919238815544857 0) // Vertex D6 = 30 
(-0.0919238815540166 -0.0919238815544857 0) // Vertex D7 = 31 

//Plane E:
(0.108858192431988 -0.108858192432544 0.51) // Vertex E0 = 32 
(0.108858192431988 0.108858192432544 0.51) // Vertex E1 = 33 
(-0.108858192431988 0.108858192432544 0.51) // Vertex E2 = 34 
(-0.108858192431988 -0.108858192432544 0.51) // Vertex E3 = 35 
(0.155511703474269 -0.155511703475062 0.51) // Vertex E4 = 36 
(0.155511703474269 0.155511703475062 0.51) // Vertex E5 = 37 
(-0.155511703474269 0.155511703475062 0.51) // Vertex E6 = 38 
(-0.155511703474269 -0.155511703475062 0.51) // Vertex E7 = 39 

//Plane F:
(0.108858192431988 -0.108858192432544 1.1) // Vertex F0 = 40 
(0.108858192431988 0.108858192432544 1.1) // Vertex F1 = 41 
(-0.108858192431988 0.108858192432544 1.1) // Vertex F2 = 42 
(-0.108858192431988 -0.108858192432544 1.1) // Vertex F3 = 43 
(0.155511703474269 -0.155511703475062 1.1) // Vertex F4 = 44 
(0.155511703474269 0.155511703475062 1.1) // Vertex F5 = 45 
(-0.155511703474269 0.155511703475062 1.1) // Vertex F6 = 46 
(-0.155511703474269 -0.155511703475062 1.1) // Vertex F7 = 47 

);

// Defining blocks:
blocks
(
    //Blocks between plane A and plane B:
    // block0 - positive x O-grid block
    hex (5 1 0 4 13 9 8 12 ) AB
    (15 20 10)
    simpleGrading (5 1 1)
    // block1 - positive y O-grid block
    hex (6 2 1 5 14 10 9 13 ) AB
    (15 20 10)
    simpleGrading (5 1 1)
    // block2 - negative x O-grid block
    hex (7 3 2 6 15 11 10 14 ) AB
    (15 20 10)
    simpleGrading (5 1 1)
    // block3 - negative y O-grid block
    hex (4 0 3 7 12 8 11 15 ) AB
    (15 20 10)
    simpleGrading (5 1 1)
    // block4 - central O-grid block
    hex (0 1 2 3 8 9 10 11 ) AB
    (20 20 10)
    simpleGrading (1 1 1)

    //Blocks between plane B and plane C:
    // block0 - positive x O-grid block
    hex (13 9 8 12 21 17 16 20 ) BC
    (15 20 4)
    simpleGrading (5 1 1)
    // block1 - positive y O-grid block
    hex (14 10 9 13 22 18 17 21 ) BC
    (15 20 4)
    simpleGrading (5 1 1)
    // block2 - negative x O-grid block
    hex (15 11 10 14 23 19 18 22 ) BC
    (15 20 4)
    simpleGrading (5 1 1)
    // block3 - negative y O-grid block
    hex (12 8 11 15 20 16 19 23 ) BC
    (15 20 4)
    simpleGrading (5 1 1)
    // block4 - central O-grid block
    hex (8 9 10 11 16 17 18 19 ) BC
    (20 20 4)
    simpleGrading (1 1 1)

    //Blocks between plane C and plane D:
    // block0 - positive x O-grid block
    hex (21 17 16 20 29 25 24 28 ) CD
    (15 20 6)
    simpleGrading (5 1 1)
    // block1 - positive y O-grid block
    hex (22 18 17 21 30 26 25 29 ) CD
    (15 20 6)
    simpleGrading (5 1 1)
    // block2 - negative x O-grid block
    hex (23 19 18 22 31 27 26 30 ) CD
    (15 20 6)
    simpleGrading (5 1 1)
    // block3 - negative y O-grid block
    hex (20 16 19 23 28 24 27 31 ) CD
    (15 20 6)
    simpleGrading (5 1 1)
    // block4 - central O-grid block
    hex (16 17 18 19 24 25 26 27 ) CD
    (20 20 6)
    simpleGrading (1 1 1)

    //Blocks between plane D and plane E:
    // block0 - positive x O-grid block
    hex (29 25 24 28 37 33 32 36 ) DE
    (15 20 30)
    simpleGrading (5 1 1)
    // block1 - positive y O-grid block
    hex (30 26 25 29 38 34 33 37 ) DE
    (15 20 30)
    simpleGrading (5 1 1)
    // block2 - negative x O-grid block
    hex (31 27 26 30 39 35 34 38 ) DE
    (15 20 30)
    simpleGrading (5 1 1)
    // block3 - negative y O-grid block
    hex (28 24 27 31 36 32 35 39 ) DE
    (15 20 30)
    simpleGrading (5 1 1)
    // block4 - central O-grid block
    hex (24 25 26 27 32 33 34 35 ) DE
    (20 20 30)
    simpleGrading (1 1 1)

    //Blocks between plane E and plane F:
    // block0 - positive x O-grid block
    hex (37 33 32 36 45 41 40 44 ) EF
    (15 20 10)
    simpleGrading (5 1 1)
    // block1 - positive y O-grid block
    hex (38 34 33 37 46 42 41 45 ) EF
    (15 20 10)
    simpleGrading (5 1 1)
    // block2 - negative x O-grid block
    hex (39 35 34 38 47 43 42 46 ) EF
    (15 20 10)
    simpleGrading (5 1 1)
    // block3 - negative y O-grid block
    hex (36 32 35 39 44 40 43 47 ) EF
    (15 20 10)
    simpleGrading (5 1 1)
    // block4 - central O-grid block
    hex (32 33 34 35 40 41 42 43 ) EF
    (20 20 10)
    simpleGrading (1 1 1)

);

edges
(
    //Plane A:
    arc 0 1 (0.0728 0 -0.50)
    arc 1 2 (0 0.0728 -0.50)
    arc 2 3 (-0.0728 0 -0.50)
    arc 3 0 (0 -0.0728 -0.50)
    arc 4 5 (0.13 0 -0.50)
    arc 5 6 (0 0.13 -0.50)
    arc 6 7 (-0.13 0 -0.50)
    arc 7 4 (0 -0.13 -0.50)

    //Plane B:
    arc 8 9 (0.0728 0 -0.10)
    arc 9 10 (0 0.0728 -0.10)
    arc 10 11 (-0.0728 0 -0.10)
    arc 11 8 (0 -0.0728 -0.10)
    arc 12 13 (0.13 0 -0.10)
    arc 13 14 (0 0.13 -0.10)
    arc 14 15 (-0.13 0 -0.10)
    arc 15 12 (0 -0.13 -0.10)

    //Plane C:
    arc 16 17 (0.0728 0 -0.025)
    arc 17 18 (0 0.0728 -0.025)
    arc 18 19 (-0.0728 0 -0.025)
    arc 19 16 (0 -0.0728 -0.025)
    arc 20 21 (0.13 0 -0.025)
    arc 21 22 (0 0.13 -0.025)
    arc 22 23 (-0.13 0 -0.025)
    arc 23 20 (0 -0.13 -0.025)

    //Plane D:
    arc 24 25 (0.0728 0 0)
    arc 25 26 (0 0.0728 0)
    arc 26 27 (-0.0728 0 0)
    arc 27 24 (0 -0.0728 0)
    arc 28 29 (0.13 0 0)
    arc 29 30 (0 0.13 0)
    arc 30 31 (-0.13 0 0)
    arc 31 28 (0 -0.13 0)

    //Plane E:
    arc 32 33 (0.123158985690504 0 0.51)
    arc 33 34 (0 0.123158985690504 0.51)
    arc 34 35 (-0.123158985690504 0 0.51)
    arc 35 32 (0 -0.123158985690504 0.51)
    arc 36 37 (0.219926760161615 0 0.51)
    arc 37 38 (0 0.219926760161615 0.51)
    arc 38 39 (-0.219926760161615 0 0.51)
    arc 39 36 (0 -0.219926760161615 0.51)

    //Plane F:
    arc 40 41 (0.123158985690504 0 1.1)
    arc 41 42 (0 0.123158985690504 1.1)
    arc 42 43 (-0.123158985690504 0 1.1)
    arc 43 40 (0 -0.123158985690504 1.1)
    arc 44 45 (0.219926760161615 0 1.1)
    arc 45 46 (0 0.219926760161615 1.1)
    arc 46 47 (-0.219926760161615 0 1.1)
    arc 47 44 (0 -0.219926760161615 1.1)

);

// Defining patches:
patches
(
    patch inlet
    (
       (1 5 4 0)
       (2 6 5 1)
       (3 7 6 2)
       (0 4 7 3)
       (3 2 1 0)
    )
    patch outlet
    (
       (40 44 45 41)
       (41 45 46 42)
       (42 46 47 43)
       (43 47 44 40)
       (40 41 42 43)
    )
    wall wallProlongation
    (
       (36 37 45 44)
       (37 38 46 45)
       (38 39 47 46)
       (39 36 44 47)
    )
    wall wallDiffuser
    (
       (28 29 37 36)
       (29 30 38 37)
       (30 31 39 38)
       (31 28 36 39)
    )
    wall statSwirlWall
    (
       (12 13 21 20)
       (13 14 22 21)
       (14 15 23 22)
       (15 12 20 23)

       (20 21 29 28)
       (21 22 30 29)
       (22 23 31 30)
       (23 20 28 31)
    )
    wall rotSwirlWall
    (
       (4 5 13 12)
       (5 6 14 13)
       (6 7 15 14)
       (7 4 12 15)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
