OpenFOAMObject/meshParticle/haukur_case_class_solver/ergoCart/constant/porousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    CD
    {
        coordinateSystem
        {
            e1  (0 0.70710678 0.70710678);
            e2  (1 0 0);
        }
        

        Darcy
        {
            d   d [0 -2 0 0 0 0 0] (5e7 1000 1000); 
         // f   f [0 -1 0 0 0 0 0] (0 0 0);
        }
    }
)

// ************************************************************************* //
