OpenFOAMObject/meshParticle/haukur_case_class_solver/ergoCart/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0.1;
    };
    
    
/*    U smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-6;
        relTol           0.1;
    };    
*/
    p GAMG
    {
        tolerance        1e-8;
        relTol           0.05;

        smoother         GaussSeidel;

        cacheAgglomeration off;

        nCellsInCoarsestLevel 20;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    h PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0.1;
    };

    k smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-7;
        relTol           0.1;
    };

    epsilon smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-7;
        relTol           0.1;
    };
}

SIMPLE
{
    nUCorrectors                 2;
    nNonOrthogonalCorrectors     0;
    pMin                         pMin   [1 -1 -2 0 0 0 0] 100;
}

/*
relaxationFactors
{
    p           0.3;
    rho         0.05;
    U           0.7;
    k           0.7;
    epsilon     0.7;
    h           0.5;
}
*/


relaxationFactors
{
    p           0.3;
    rho         1;
    U           0.7;
    k           0.9;
    epsilon     0.9;
    h           0.9;
}

// ************************************************************************* //
